---
type: VertexStreamPositionColored
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 2
tags: [revit-api, class]
---

# VertexStreamPositionColored

`Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionColored` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddVertex | 2017 | `public void AddVertex ( VertexPositionColored vertex )` |
| Method | AddVertices | 2017 | `public void AddVertices ( IList < VertexPositionColored > vertices )` |